import streamlit as st
import pandas as pd
import os
from sqlalchemy import create_engine, text

st.title("🛠️ Ενημέρωση Βάσης Δεδομένων")

db_url = os.environ.get("DB_URL")
engine = create_engine(db_url)

# Τα δεδομένα από τα αρχεία σου
data = [
    ("ΦΩΤΙΣΜΟΣ", "ΕIΧΕ ΔΙΑΚΟΠΗ ΓΡΑΜΜΗΣ ΦΩΤΙΣΜΟΥ ΕΠΙΒΑΤΩΝ ΣΤΙΣ ΚΛΕΜΕΣ ΚΑΤΩ ΑΠΟ ΤΑ ΚΑΘΙΣΜΑΤΑ", "23/02/2024", ""),
    ("ΓΕΝΝΗΤΡΙΑ", "ΕΠΕΦΤΕ Η ΜΟΝΟΦΑΣΙΚΗ ΑΣΦΑΛΕΙΑ ΡΥΘΜΙΣΤΗ ΓΕΝΝΗΤΡΙΑΣ 230V AC ΤΟΥ ΘΕΡΜΙΚΟΥ ΡΕΛΕ ΕΓΙΝΕ ΑΝΤΙΚΑΤΑΣΤΑΣΗ ΡΥΘΜΙΣΤΗ", "29/02/2024", "ΡΥΘΜΙΣΤΗΣ ΓΕΝΝΗΤΡΙΑΣ"),
    ("ΠΝΕΥΜΑΤΙΚΟ ΣΥΣΤΗΜΑ", "ΑΠΩΛΕΙΑ ΑΕΡΑ", "3/6/2024", "ΑΝΤΙΚΑΤΑΣΤΑΣΗ ΞΗΡΑΝΤΗΡΑ"),
    ("ΘΕΡΜΑΝΣΗ", "ΑΠΩΛΕΙΑ ΝΕΡΟΥ Β ΟΧΗΜΑ 4408 ΚΑΛΟΡΙΦΕΡ", "4/1/2024", "ΘΕΡΜΑΝΤΙΚΟ ΣΩΜΑ[ΚΑΛΟΡΙΦΕΡ]"),
    ("ΓΕΝΝΗΤΡΙΑ", "ΕΛΕΙΨΗ ΑΝΑΔΡΑΣΗΣ ΑΠΟ LEM T101 ΒΛΑΒΗ 297", "6/10/2024", "ΚΑΡΤΑ ΡΥΘΜΙΣΤΗ Α3"),
    ("ΕΛΞΗ", "ΒΛΑΒΗ ΑΞΟΝΑ 3 ΑΙΣΘΗΤΗΡΑ ΤΑΧΥΤΗΤΑΣ", "11/7/2024", "ΑΙΣΘΗΤΗΡΑΣ ΤΑΧΥΤΗΤΑΣ"),
    ("HBU", "ΥΠΕΡΤΑΣΗ ΣΤΟ ΤΡΙΦΑΣΙΚΟ ΚΥΚΛΩΜΑ ΑΠΟ ΑΡΜΟΝΙΚΕΣ", "23/07/2025", "ΑΝΤΙΚΑΤΑΣΤΑΣΗ ΠΥΚΝΩΤΩΝ C302.1-3, ΡΥΘΜΙΣΤΗΣ 705 186"),
    ("ΒΟΗΘΗΤΙΚΟΣ ΜΕΤΑΤΡΟΠΕΑΣ", "ΕΙΚΟΝΙΚΗ ΕΙΔΟΠΟΙΗΣΗ ΧΑΜΗΛΗΣ ΤΑΣΗΣ ΜΠΑΤΑΡΙΩΝ", "3/8/2024", "Α741 ΚΑΡΤΑ ΕΛΕΝΓΧΟΥ"),
    ("ΠΝΕΥΜΑΤΙΚΟ ΣΥΣΤΗΜΑ", "ΑΥΞΗΣΗ ΠΙΕΣΗΣ ΑΕΡΑ ΣΤΑ 10 ΑΤΜ ΑΝΤΙ ΓΙΑ 5 ΑΤΜ ΣΤΟ Α ΟΧΗΜΑ", "4/9/2024", "ΒΑΛΒΙΔΑ 109/1"),
    ("ΗΛΕΚΤΡΙΚΟ", "ΑΙΣΘΗΤΗΡΑΣ ΤΑΧΥΤΗΤΑΣ ΑΞΟΝΑΣ 6", "19/04/2024", "ΑΙΣΘΗΤΗΡΑΣ ΤΑΧΥΤΗΤΑΣ"),
    ("ΚΛΙΜΑΤΙΣΜΟΣ", "ΒΡΑΧΥΚΥΚΛΩΜΑ", "4/3/2024", "ΡΕΛΕ ΙΣΧΥΟΣ ΣΥΜΠΙΕΣΤΗ M5")
]

if st.button("Εκτέλεση Μαζικής Εισαγωγής"):
    with engine.connect() as conn:
        for item in data:
            conn.execute(text('INSERT INTO faults ("ΤΟΜΕΑΣ", "ΠΕΡΙΓΡΑΦΗ", "ΗΜΕΡΟΜΗΝΙΑ", "ΑΝΤΑΛΛΑΚΤΙΚΑ") VALUES (:t, :p, :h, :a)'), 
                         {"t": item[0], "p": item[1], "h": item[2], "a": item[3]})
        conn.commit()
    st.success("Τα δεδομένα εισήχθησαν!")

st.write("Πάτα το κουμπί για να προστεθούν τα δεδομένα από το Excel στη βάση.")


